## Scratch: hosted_zone
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_zone.form_viewer will be created
  + resource "aws_route53_zone" "form_viewer" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "forms-scratch.cdssandbox.xyz"
      + name_servers  = (known after apply)
      + tags          = {
          + "CostCenter" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all      = {
          + "CostCenter" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + zone_id       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.form_viewer"]

9 tests, 8 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
